座標型は　|T:座標型,geom|の　別名

回転君は　モジュール
　　コンソールを　使用

　　座標を読み出すは　クラスメソッド
　　　　戻り値は　座標型
　　　　一行読み出し　座標型に　変換する

　　座標を表示は　クラスメソッド
　　　　引数は　座標型
　　　　複写して　Ｘ座標を　表示して　「,」を　表示して　Ｙ座標を　表示する

　　分数は　クラスメソッド
　　　　引数は　整数型、整数型
　　　　戻り値は　分数型
　　　　分数型の　オブジェクトを作成する（２引数）

　　|Main|は　クラスメソッド
　　　　一行読み出して　整数型に　変換して
　　　　　　点の個数という　新しい変数に入れる
　　　　点の個数を　表示して　改行する
　　　　点の個数の　回数だけ繰り返す
　　　　　　一行読み出して　表示して　改行する

　　　　一行読み出して　整数型に　変換して
　　　　　　面の個数という　新しい変数に入れる
　　　　面の個数を　表示して　改行する
　　　　面の個数の　回数だけ繰り返す
　　　　　　一行読み出して　表示して　改行する

　　　　点の個数の　回数だけ繰り返す
　　　　　　座標を読み出し　Ｐという　新しい変数に入れ
　　　　　　５、１３の　分数と　１２、１３の　分数と
　　　　　　−１２、１３の　分数と　５、１３の　分数で　Ｐを　回転して
　　　　　　座標を表示して　改行する
