折り紙型は　|T:折紙型,origami|の　別名
座標型は　|T:座標型,geom|の　別名

ソルバー型は　クラス
　　折り紙は　折り紙型の　フィールド

　　座標とは　クラスメソッド
　　　　引数は　文字列型
　　　　戻り値は　座標型
　　　　（引数を）　座標型に　変換する
　　　　
　　折り紙を準備するとは　メソッド
　　　　折り紙型の　インスタンスを作成して　折り紙に　入れる

　　解答文字列は　メソッド
　　　　戻り値は　文字列型
　　　　折り紙の　状態文字列

　　問題１を解くとは　メソッド　　　　
　　　　折り紙を準備するだけ

　　問題２を解くとは　メソッド
　　　　折り紙を準備する
　　　　「0,0」の　座標から　「2,2」の　座標に　折り紙を　折る

　　問題３を解くとは　メソッド
　　　　折り紙を準備する
　　　　「0,0」の　座標から　「2,2」の　座標に　折り紙を　折る
　　　　「1,1」の　座標から　「1/2,1/2」の　座標に　折り紙を　折る

　　問題４を解くとは　メソッド
　　　　折り紙を準備する
　　　　「0,0」の　座標から
　　　　「1267650600228229401496703205377,1267650600228229401496703205377」の
　　　　　　座標に　折り紙を　折る

　　問題８を解くとは　メソッド
　　　　折り紙を準備する
　　　　「1,0」の　座標から　「0,0」の　座標に　折り紙を　折る
　　　　「0,1」の　座標から　「0,0」の　座標に　折り紙を　折る

　　問題９を解くとは　メソッド
　　　　折り紙を準備する
　　　　「1,0」の　座標から　「0,0」の　座標に　折り紙を　折る
　　　　「0,1」の　座標から　「0,1/3」の　座標に　折り紙を　折る

　　問題１０を解くとは　メソッド
　　　　折り紙を準備する
　　　　「1,0」の　座標から　「3/7,0」の　座標に　折り紙を　折る
　　　　「0,1」の　座標から　「0,3/7」の　座標に　折り紙を　折る
　　　　「1,1」の　座標から　「-1,-1」の　座標に　折り紙を　折る
　　　　「0,0」の　座標から　「1/7,1/7」の　座標に　折り紙を　折る

　　問題１１を解くとは　メソッド
　　　　折り紙を準備する
　　　　「1,1」の　座標から　「1/3,1/3」の　座標に　折り紙を　折る

　　問題１２を解くとは　メソッド
　　　　折り紙を準備する
　　　　「1,1」の　座標から　「11/15,7/15」の　座標に　折り紙を　折る

　　問題１４を解くとは　メソッド
　　　　折り紙を準備する
　　　　「0,0」の　座標から　「6/17,24/17」の　座標に　折り紙を　折る

　　問題１５を解くとは　メソッド
　　　　折り紙を準備する
　　　　「0,1」の　座標から　「-1/5,2/5」の　座標に　折り紙を　折る

　　問題１６を解くとは　メソッド
　　　　折り紙を準備する
　　　　「1,1」の　座標から　「3/10,-2/5」の　座標に　折り紙を　折る
