座標型は　|T:座標型,geom|の　別名

ＸＹ入替君は　モジュール
　　コンソールを　使用

　　座標を読み出すは　クラスメソッド
　　　　戻り値は　座標型
　　　　一行読み出し　座標型に　変換する

　　座標を表示は　クラスメソッド
　　　　引数は　座標型
　　　　複写して　Ｘ座標を　表示して　「,」を　表示して　Ｙ座標を　表示する

　　|Main|は　クラスメソッド
　　　　一行読み出して　整数型に　変換して
　　　　　　点の個数という　新しい変数に入れる
　　　　点の個数を　表示して　改行する
　　　　点の個数の　回数だけ繰り返す
　　　　　　一行読み出して　表示して　改行する

　　　　一行読み出して　整数型に　変換して
　　　　　　面の個数という　新しい変数に入れる
　　　　面の個数を　表示して　改行する
　　　　面の個数の　回数だけ繰り返す
　　　　　　一行読み出して　表示して　改行する

　　　　点の個数の　回数だけ繰り返す
　　　　　　座標を読み出し　Ｐという　新しい変数に入れ
　　　　　　※　Ｘ、Ｙを　入れ替える
　　　　　　Ｐの　Ｘ座標　Ｐの　Ｙ座標
　　　　　　Ｐの　Ｘ座標に　入れる　Ｐの　Ｙ座標に　入れる
　　　　　　Ｐの　座標を表示して　改行する
